#Область ПрограммныйИнтерфейс

Функция СведенияОВнешнейОбработке() Экспорт
  
  Наименование = НСтр(СтрЗаменить("ru = '%1'", "%1", Метаданные().Представление()));
  
  ПараметрыРегистрации = ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке();
  ПараметрыРегистрации.Информация = Наименование;
  ПараметрыРегистрации.Вид = ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
  ПараметрыРегистрации.БезопасныйРежим = Ложь;
  ПараметрыРегистрации.Версия = "1.0";
  
  Команда = ПараметрыРегистрации.Команды.Добавить();
  Команда.Представление = Наименование;
  Команда.Использование = ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыОткрытиеФормы();
  Команда.ПоказыватьОповещение = Истина;

  Возврат ПараметрыРегистрации;
  
КонецФункции

#КонецОбласти